docs/v2_bench40.log
nohup: ignoring input
INFO 08-30 17:52:01 [__init__.py:52] Available plugins for group vllm.platform_plugins:
INFO 08-30 17:52:01 [__init__.py:54] - ascend -> vllm_ascend:register
INFO 08-30 17:52:01 [__init__.py:57] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 08-30 17:52:01 [__init__.py:237] Platform plugin ascend is activated
INFO 08-30 17:52:01 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
/vllm-workspace/vllm-omni/vllm_omni/__init__.py:19: RuntimeWarning: Failed to import version from _version.py: No module named 'vllm_omni._version'
This typically happens in development mode before building.
Using fallback version 'dev'.
  from .version import __version__, __version_tuple__  # isort:skip # noqa: F401
INFO 08-30 17:52:15 [patch.py:252] NVFP4 W4A4 weight_scale NaN-clamp: installed.
INFO 08-30 17:52:15 [patch.py:564] [cumem-cuda] CuMemAllocator._python_free_callback patched: asleep guard extended to all platforms.
INFO 08-30 17:52:19 [main.py:54] Delegating entrypoint handling to vllm-omni
2026-08-30 17:52:19,264 - 1872270 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.1.dev1+ge5588e49b.empty: default 0
INFO 08-30 17:52:19 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 08-30 17:52:19 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
TrackingNamespace(subparser='bench', bench_type='serve', dispatch_function=<function OmniBenchmarkServingSubcommand.cmd at 0xfffe82b78040>, omni=True, trust_remote_code=True, seed=0, num_prompts=40, dataset_name='seed-tts', no_stream=False, dataset_path='/tmp/seedtts/seedtts_testset', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat-omni', base_url=None, host='127.0.0.1', port=8091, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='/workspace/shared_assets/models/OpenBMB/MiniCPM-o-4_5', input_len=None, output_len=None, tokenizer='/workspace/shared_assets/models/OpenBMB/MiniCPM-o-4_5', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el,audio_ttfp,audio_rtf', metric_percentiles='99', goodput=None, request_id_prefix='bench-6aff195f-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'modalities': ['text', 'audio'], 'chat_template_kwargs': {'enable_thinking': False, 'use_tts_template': True}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False, daily_omni_qa_json=None, daily_omni_video_dir=None, daily_omni_inline_local_video=False, daily_omni_input_mode='all', daily_omni_pack_mode='qwen', daily_omni_save_eval_items=False, videomme_parquet=None, videomme_video_dir=None, videomme_subtitle_dir=None, videomme_pack_mode='minicpm-frames', videomme_max_frames=None, videomme_duration='all', videomme_use_subtitle=False, videomme_inline_local_video=False, videomme_save_eval_items=False, seed_tts_locale='zh', seed_tts_turns_per_session=1, seed_tts_root=None, seed_tts_file_ref_audio=False, seed_tts_inline_ref_audio=False, seed_tts_system_prompt=None, seed_tts_wer_eval=True, seed_tts_wer_save_items=True, print_stage=False, bot_task='think')
INFO 08-30 17:52:21 [seed_tts_dataset.py:210] Loaded Seed-TTS: root=/tmp/seedtts/seedtts_testset locale=zh rows=2020 inline_ref_audio=True
INFO 08-30 17:52:21 [seed_tts_dataset.py:283] Seed-TTS: built 40 sessions (asked 40, turns_per_session=1)
INFO 08-30 17:52:21 [datasets.py:309] Skipping oversampling. Total samples: 40.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:02<00:00,  1.22s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 40/40 [00:39<00:00,  1.00it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  39.84     
Request throughput (req/s):              1.00      
Peak concurrent requests:                3.00      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          994.96    
Median E2EL (ms):                        980.44    
P99 E2EL (ms):                           1389.56   
================== Text Result ===================
Total input tokens:                      5947      
Total generated tokens:                  507       
Output token throughput (tok/s):         12.73     
Peak output token throughput (tok/s):    24.00     
Peak concurrent requests:                3.00      
Total Token throughput (tok/s):          162.00    
---------------Time to First Token----------------
Mean TTFT (ms):                          92.40     
Median TTFT (ms):                        89.11     
P99 TTFT (ms):                           111.95    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
================== Audio Result ==================
Total audio duration generated(s):       186.12    
Total audio frames generated:            4466880   
Audio throughput(audio duration/s):      4.67      
Streaming continuity OK rate:            100.00%   
---------------Time to First Packet---------------
Mean AUDIO_TTFP (ms):                    333.21    
Median AUDIO_TTFP (ms):                  331.57    
P99 AUDIO_TTFP (ms):                     362.07    
-----------------Real Time Factor-----------------
Mean AUDIO_RTF:                          0.21      
Median AUDIO_RTF:                        0.21      
P99 AUDIO_RTF:                           0.26      
==================================================
WARNING 08-30 17:53:07 [seed_tts_eval.py:444] Loading Seed-TTS eval Paraformer 'paraformer-zh' on npu:0 (one-time, seed-tts-eval protocol)...
2026-08-30 17:53:09,307 [INFO] download models from model hub: ms
2026-08-30 17:53:09,887 | INFO    | modelscope_hub.download | Downloading 13 files from iic/speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch@master
funasr version: 1.4.4.
Check update of funasr, and it would cost few times. You may disable it by set `disable_update=True` in AutoModel
New version is available: 1.4.9.
Please use the command "pip install -U funasr" to upgrade.
Downloading: 100%|██████████| 13/13 [00:01<00:00, 10.43file/s]
2026-08-30 17:53:11,181 [WARNING] trust_remote_code: False
2026-08-30 17:53:13,978 [INFO] Loading pretrained params from /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt
2026-08-30 17:53:13,987 [INFO] ckpt: /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt
2026-08-30 17:53:15,863 [INFO] scope_map: ['module.', 'None']
2026-08-30 17:53:15,864 [INFO] excludes: None
2026-08-30 17:53:15,989 [INFO] Loading ckpt: /root/.cache/modelscope/models/iic--speech_seaco_paraformer_large_asr_nat-zh-cn-16k-common-vocab8404-pytorch/snapshots/master/model.pt, status: <All keys matched successfully>
rtf_avg: 0.232: 100%|██████████| 1/1 [00:01<00:00,  1.32s/it]
2026-08-30 17:53:19,327 [INFO] get env SEED_TTS_SIM_EVAL = 1
2026-08-30 17:53:19,338 [INFO] get env SEED_TTS_WAVLM_MODEL = microsoft/wavlm-base-plus
WARNING 08-30 17:53:19 [seed_tts_eval.py:252] Loading WavLM 'microsoft/wavlm-base-plus' on npu:0 for Seed-TTS SIM (embedding cosine; not identical to seed-tts-eval UniSpeech SV checkpoint).
2026-08-30 17:53:19,340 [INFO] get env AI_AGENT = github_copilot_vscode_agent
2026-08-30 17:53:19,340 [INFO] get env TERM_PROGRAM = vscode
Loading weights: 100%|██████████| 248/248 [00:00<00:00, 20176.66it/s]
rtf_avg: 0.042: 100%|██████████| 1/1 [00:00<00:00,  4.03it/s]
rtf_avg: 0.045: 100%|██████████| 1/1 [00:00<00:00,  4.25it/s]
rtf_avg: 0.048: 100%|██████████| 1/1 [00:00<00:00,  4.71it/s]
rtf_avg: 0.039: 100%|██████████| 1/1 [00:00<00:00,  5.70it/s]
rtf_avg: 0.049: 100%|██████████| 1/1 [00:00<00:00,  5.00it/s]
rtf_avg: 0.050: 100%|██████████| 1/1 [00:00<00:00,  5.41it/s]
rtf_avg: 0.039: 100%|██████████| 1/1 [00:00<00:00,  5.81it/s]
rtf_avg: 0.049: 100%|██████████| 1/1 [00:00<00:00,  4.80it/s]
rtf_avg: 0.055: 100%|██████████| 1/1 [00:00<00:00,  4.41it/s]
rtf_avg: 0.054: 100%|██████████| 1/1 [00:00<00:00,  3.30it/s]
rtf_avg: 0.063: 100%|██████████| 1/1 [00:00<00:00,  3.74it/s]
rtf_avg: 0.059: 100%|██████████| 1/1 [00:00<00:00,  3.53it/s]
rtf_avg: 0.052: 100%|██████████| 1/1 [00:00<00:00,  4.36it/s]
rtf_avg: 0.060: 100%|██████████| 1/1 [00:00<00:00,  3.68it/s]
rtf_avg: 0.065: 100%|██████████| 1/1 [00:00<00:00,  4.07it/s]
rtf_avg: 0.049: 100%|██████████| 1/1 [00:00<00:00,  3.94it/s]
rtf_avg: 0.073: 100%|██████████| 1/1 [00:00<00:00,  2.47it/s]
rtf_avg: 0.052: 100%|██████████| 1/1 [00:00<00:00,  4.46it/s]
rtf_avg: 0.052: 100%|██████████| 1/1 [00:00<00:00,  3.67it/s]
rtf_avg: 0.046: 100%|██████████| 1/1 [00:00<00:00,  4.15it/s]
rtf_avg: 0.061: 100%|██████████| 1/1 [00:00<00:00,  4.48it/s]
rtf_avg: 0.049: 100%|██████████| 1/1 [00:00<00:00,  4.57it/s]
rtf_avg: 0.056: 100%|██████████| 1/1 [00:00<00:00,  4.75it/s]
rtf_avg: 0.105: 100%|██████████| 1/1 [00:00<00:00,  2.69it/s]
rtf_avg: 0.082: 100%|██████████| 1/1 [00:00<00:00,  2.77it/s]
rtf_avg: 0.062: 100%|██████████| 1/1 [00:00<00:00,  4.28it/s]
rtf_avg: 0.076: 100%|██████████| 1/1 [00:00<00:00,  2.47it/s]
rtf_avg: 0.079: 100%|██████████| 1/1 [00:00<00:00,  2.65it/s]
rtf_avg: 0.077: 100%|██████████| 1/1 [00:00<00:00,  2.05it/s]
rtf_avg: 0.079: 100%|██████████| 1/1 [00:00<00:00,  2.39it/s]
rtf_avg: 0.067: 100%|██████████| 1/1 [00:00<00:00,  3.17it/s]
rtf_avg: 0.039: 100%|██████████| 1/1 [00:00<00:00,  6.11it/s]
rtf_avg: 0.068: 100%|██████████| 1/1 [00:00<00:00,  3.83it/s]
rtf_avg: 0.054: 100%|██████████| 1/1 [00:00<00:00,  3.36it/s]
rtf_avg: 0.063: 100%|██████████| 1/1 [00:00<00:00,  3.59it/s]
rtf_avg: 0.038: 100%|██████████| 1/1 [00:00<00:00,  5.89it/s]
rtf_avg: 0.059: 100%|██████████| 1/1 [00:00<00:00,  3.38it/s]
rtf_avg: 0.038: 100%|██████████| 1/1 [00:00<00:00,  5.95it/s]
rtf_avg: 0.036: 100%|██████████| 1/1 [00:00<00:00,  4.97it/s]
===== Seed-TTS eval (seed-tts-eval protocol) =====
Evaluated (WER, lower is better):        40        
Mean WER:                                0.0062    
Median WER:                              0.0000    
Request failed:                          0         
No PCM captured:                         0         
ASR / WER failed:                        0         
SIM evaluated (higher ~ closer):         40        
Mean SIM:                                0.8408    
Median SIM:                              0.8501    
SIM skipped (no ref path):               0         
SIM embedding errors:                    0         
==================================================